# Data Cleaning Pandas Assignment

It happens all the time: someone gives you data containing malformed strings,
Python, lists and missing data. How do you tidy it up so you can get on with the
analysis?
Take this monstrosity as the DataFrame to use in the following puzzles:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
                    'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
                    'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                    'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )','12. Air France', '"Swiss Air"']})

In [3]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [4]:
#Renaming the columns FlightNumber and RecentDelays to Flight_Number and Recent_Delays respectively
df.rename(columns={'FlightNumber':'Flight_Number','RecentDelays':'Recent_Delays'},inplace=True)
df

            From_To  Flight_Number Recent_Delays              Airline
0      LoNDon_paris        10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN            NaN            []    <Air France> (12)
2  londON_StockhOlm        10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis            NaN          [13]       12. Air France
4   Brussels_londOn        10085.0      [67, 32]          "Swiss Air"

1. Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with 
each row so 10055 and 10075 need to be put in place. Fill in these missing numbers and make the column an 
integer column (instead of a float column).

In [5]:
# Select 1st and 3rd row and column "Flight_Number" having NaN values and assign them with respective values
df.loc[[1,3],'Flight_Number']= 10055.0, 10075.0

In [6]:
df

            From_To  Flight_Number Recent_Delays              Airline
0      LoNDon_paris        10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN        10055.0            []    <Air France> (12)
2  londON_StockhOlm        10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis        10075.0          [13]       12. Air France
4   Brussels_londOn        10085.0      [67, 32]          "Swiss Air"

In [7]:
# Convert Flight_Number Column into integer type
df.Flight_Number=df.Flight_Number.astype('int64')

In [8]:
df

            From_To  Flight_Number Recent_Delays              Airline
0      LoNDon_paris          10045      [23, 47]               KLM(!)
1      MAdrid_miLAN          10055            []    <Air France> (12)
2  londON_StockhOlm          10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis          10075          [13]       12. Air France
4   Brussels_londOn          10085      [67, 32]          "Swiss Air"

2. The From_To column would be better as two separate columns! Split each string on the underscore delimiter _ to give a new temporary DataFrame with the correct values. Assign the correct column names to this temporary DataFrame.

In [9]:
# String method split is used to split the column by separator underscore(_). Expand = True will make them as separate columns
new_df=df.From_To.str.split(pat='_',n=1,expand=True)
new_df.columns=['From','To']
new_df

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

3. Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame. 
Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".)

Method 1

In [10]:
#Define a Lambda Function
title=lambda x: x.title()

In [11]:
# Apply Lambda function on From Column to make it type Title
new_df.From=new_df.From.apply(title)

In [12]:
# Apply Lambda function on To Column to make it type Title
new_df.To=new_df.To.apply(title)

In [13]:
new_df

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

Method 2

In [14]:
# Apply string Title Function directly on From column to make it type Title
new_df.From=new_df.From.str.title()

In [15]:
# Apply string Title Function directly on To column to make it type Title
new_df.To=new_df.To.str.title()

In [16]:
new_df

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

4. Delete the From_To column from df and attach the temporary DataFrame from the previous questions.

In [17]:
# Drop From_To columns from dataframe (df) permanently
df.drop(columns='From_To',inplace=True)

In [18]:
# Attach temporary Dataframe (Method1)
df[['From','To']] = new_df[['From','To']]

In [19]:
# Attach temporary Dataframe (Method2)
df[['From','To']] = new_df

In [20]:
df

   Flight_Number Recent_Delays              Airline      From         To
0          10045      [23, 47]               KLM(!)    London      Paris
1          10055            []    <Air France> (12)    Madrid      Milan
2          10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3          10075          [13]       12. Air France  Budapest      Paris
4          10085      [67, 32]          "Swiss Air"  Brussels     London

Shift From and To as 1st 2 columns

In [21]:
df.columns

Index(['Flight_Number', 'Recent_Delays', 'Airline', 'From', 'To'], dtype='object')

In [22]:
shift_columns=['From', 'To','Flight_Number', 'Recent_Delays', 'Airline']

In [23]:
df=df[shift_columns]

In [24]:
df

       From         To  Flight_Number Recent_Delays              Airline
0    London      Paris          10045      [23, 47]               KLM(!)
1    Madrid      Milan          10055            []    <Air France> (12)
2    London  Stockholm          10065  [24, 43, 87]  (British Airways. )
3  Budapest      Paris          10075          [13]       12. Air France
4  Brussels     London          10085      [67, 32]          "Swiss Air"

5. In the RecentDelays column, the values have been entered into the DataFrame as a list. We would like each first value 
in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value should be NaN.

In [25]:
# Convert the Recent_Delays column into a list and then convert it into a data frame
df_delay=pd.DataFrame(df.Recent_Delays.tolist())

In [26]:
df_delay

      0     1     2
0  23.0  47.0   NaN
1   NaN   NaN   NaN
2  24.0  43.0  87.0
3  13.0   NaN   NaN
4  67.0  32.0   NaN

6. Expand the Series of lists into a DataFrame named delays, rename the columns delay_1, delay_2, etc. and replace the 
unwanted RecentDelays column in df with delays.

In [27]:
# Use Lambda function to rename columns
rename_columns = lambda x: 'delay_'+str((x+1))

In [28]:
#Just a display of list of columns
list(df_delay.columns)

[0, 1, 2]

In [29]:
# Call Lambda function using map and store the renamed column name in columns
columns= list(map(rename_columns,list(df_delay.columns)))

In [30]:
# Re-assign the column values
df_delay.columns= columns

In [31]:
df_delay

   delay_1  delay_2  delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [32]:
# First drop the column Recent_Delays from original dataFrame
df.drop(columns='Recent_Delays',inplace=True)

C:\Users\Sumit\anaconda3\lib\site-packages\pandas\core\frame.py:3997: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

In [33]:
#Then insert the column values from newly created dataframe
df[columns]=df_delay[columns]

In [34]:
df

,From,To,Flight_Number,Airline,delay_1,delay_2,delay_3
0,London,Paris,10045,KLM(!),23.0,47.0,NaN
1,Madrid,Milan,10055,<Air France> (12),NaN,NaN,NaN
2,London,Stockholm,10065,(British Airways. ),24.0,43.0,87.0
3,Budapest,Paris,10075,12. Air France,13.0,NaN,NaN
4,Brussels,London,10085,"""Swiss Air""",67.0,32.0,NaN